# SQL Assignment – Questions & Answers

_All sections combined: SQL Basics, SQL Commands, Functions, Joins, Window Functions, Normalisation & CTE._

### SQL BASICS – Q1
**Question:** Create a table called employees with: emp_id INT NOT NULL PRIMARY KEY, emp_name TEXT NOT NULL, age INT (>=18), email UNIQUE, salary DECIMAL DEFAULT 30000.

**Answer:**

```sql
CREATE TABLE employees (
    emp_id INT NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INT CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);
```

### SQL BASICS – Q2
**Question:** Explain the purpose of constraints and how they help maintain data integrity. Give examples.

**Answer:**

**Answer:**
- **PRIMARY KEY**: row uniqueness & identification.
- **NOT NULL**: prevents missing values.
- **UNIQUE**: prevents duplicates.
- **CHECK**: validates business rules (e.g., age >= 18).
- **FOREIGN KEY**: referential integrity between related tables.
These constraints ensure accuracy, consistency, and reliability of data by blocking invalid writes.

### SQL BASICS – Q3
**Question:** Why apply NOT NULL? Can a primary key contain NULL values?

**Answer:**

**Answer:**
- Use **NOT NULL** to guarantee a value is always present (no incomplete data).
- A **PRIMARY KEY cannot be NULL** because keys must uniquely identify rows; NULL represents unknown, breaking uniqueness.

### SQL BASICS – Q4
**Question:** Steps/SQL to add or remove constraints on an existing table (example for both).

**Answer:**

```sql
-- Add a CHECK constraint
ALTER TABLE employees
ADD CONSTRAINT chk_salary CHECK (salary > 0);

-- Remove the constraint
ALTER TABLE employees
DROP CONSTRAINT chk_salary;
```

### SQL BASICS – Q5
**Question:** Consequences of violating constraints; show an example error.

**Answer:**

**Answer:**
- **NOT NULL** violation → cannot insert/update a NULL.
- **UNIQUE** violation → duplicate value error.
- **CHECK** violation → value out of allowed range.
- **FOREIGN KEY** violation → missing/linked parent row.

Example:
```
ERROR: duplicate key value violates unique constraint "employees_email_key"
```

### SQL BASICS – Q6
**Question:** Products table was created without constraints. Make product_id PRIMARY KEY and price default 50.00.

**Answer:**

```sql
ALTER TABLE products
ADD PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;
```

### SQL BASICS – Q7
**Question:** Students & Classes tables: fetch student_name and class_name for each student using INNER JOIN.

**Answer:**

```sql
SELECT s.student_name, c.class_name
FROM Students AS s
INNER JOIN Classes AS c
  ON s.class_id = c.class_id;
```

### SQL BASICS – Q8
**Question:** Orders, Customers, Products: list all order_id, customer_name, product_name ensuring **all products** appear (use INNER + LEFT JOIN).

**Answer:**

```sql
SELECT o.order_id, c.customer_name, p.product_name
FROM Products AS p
LEFT JOIN Orders AS o
  ON p.product_id = o.product_id
LEFT JOIN Customers AS c
  ON o.customer_id = c.customer_id;
```

### SQL BASICS – Q9
**Question:** Sales & Products: total sales amount for each product using INNER JOIN + SUM().

**Answer:**

```sql
SELECT p.product_name, SUM(s.amount) AS total_sales
FROM Sales AS s
INNER JOIN Products AS p
  ON s.product_id = p.product_id
GROUP BY p.product_name;
```

### SQL BASICS – Q10
**Question:** Orders, Customers, Order_Details: show order_id, customer_name, and quantity using INNER JOIN between all three.

**Answer:**

```sql
SELECT o.order_id, c.customer_name, od.quantity
FROM Orders AS o
INNER JOIN Customers AS c
  ON o.customer_id = c.customer_id
INNER JOIN Order_Details AS od
  ON o.order_id = od.order_id;
```

### SQL COMMANDS – Q1
**Question:** Identify primary keys & foreign keys in the DB. Discuss differences.

**Answer:**

```sql
-- List primary keys (MySQL)
SELECT k.table_name, k.column_name, k.constraint_name
FROM information_schema.key_column_usage AS k
JOIN information_schema.table_constraints AS tc
  ON k.constraint_name = tc.constraint_name
 AND k.table_schema = tc.table_schema
WHERE tc.constraint_type = 'PRIMARY KEY'
  AND k.table_schema = DATABASE();

-- List foreign keys
SELECT k.table_name, k.column_name, k.referenced_table_name, k.referenced_column_name
FROM information_schema.key_column_usage AS k
WHERE k.referenced_table_name IS NOT NULL
  AND k.table_schema = DATABASE();
```

**Answer (difference):** A **Primary Key** uniquely identifies rows within its table and cannot be NULL; a **Foreign Key** references a PK (or unique key) in another table to enforce referential integrity.

### SQL COMMANDS – Q2
**Question:** List all details of actors.

**Answer:**

```sql
SELECT * FROM actor;
```

### SQL COMMANDS – Q3
**Question:** List all customer information.

**Answer:**

```sql
SELECT * FROM customer;
```

### SQL COMMANDS – Q4
**Question:** List different countries.

**Answer:**

```sql
SELECT DISTINCT country FROM country;
```

### SQL COMMANDS – Q5
**Question:** Display all active customers.

**Answer:**

```sql
SELECT * FROM customer WHERE active = 1;
```

### SQL COMMANDS – Q6
**Question:** List all rental IDs for customer with ID 1.

**Answer:**

```sql
SELECT rental_id FROM rental WHERE customer_id = 1;
```

### SQL COMMANDS – Q7
**Question:** Display all films whose rental duration is greater than 5.

**Answer:**

```sql
SELECT * FROM film WHERE rental_duration > 5;
```

### SQL COMMANDS – Q8
**Question:** Total number of films with replacement cost > 15 and < 20.

**Answer:**

```sql
SELECT COUNT(*) AS film_count FROM film WHERE replacement_cost > 15 AND replacement_cost < 20;
```

### SQL COMMANDS – Q9
**Question:** Count of unique first names of actors.

**Answer:**

```sql
SELECT COUNT(DISTINCT first_name) AS unique_first_names FROM actor;
```

### SQL COMMANDS – Q10
**Question:** First 10 records from the customer table.

**Answer:**

```sql
SELECT * FROM customer ORDER BY customer_id LIMIT 10;
```

### SQL COMMANDS – Q11
**Question:** First 3 records from customer whose first name starts with 'b'.

**Answer:**

```sql
SELECT * FROM customer WHERE first_name LIKE 'B%' ORDER BY customer_id LIMIT 3;
```

### SQL COMMANDS – Q12
**Question:** Names of first 5 movies rated 'G'.

**Answer:**

```sql
SELECT title FROM film WHERE rating = 'G' ORDER BY title LIMIT 5;
```

### SQL COMMANDS – Q13
**Question:** Find customers whose first name starts with 'a'.

**Answer:**

```sql
SELECT * FROM customer WHERE first_name LIKE 'A%';
```

### SQL COMMANDS – Q14
**Question:** Find customers whose first name ends with 'a'.

**Answer:**

```sql
SELECT * FROM customer WHERE first_name LIKE '%a';
```

### SQL COMMANDS – Q15
**Question:** First 4 cities that start and end with 'a'.

**Answer:**

```sql
SELECT city FROM city WHERE city LIKE 'A%a' LIMIT 4;
```

### SQL COMMANDS – Q16
**Question:** Customers whose first name has 'NI' in any position.

**Answer:**

```sql
SELECT * FROM customer WHERE UPPER(first_name) LIKE '%NI%';
```

### SQL COMMANDS – Q17
**Question:** Customers whose first name has 'r' in the second position.

**Answer:**

```sql
SELECT * FROM customer WHERE first_name LIKE '_r%';
```

### SQL COMMANDS – Q18
**Question:** Customers whose first name starts with 'a' and length ≥ 5.

**Answer:**

```sql
SELECT * FROM customer WHERE first_name LIKE 'A%' AND CHAR_LENGTH(first_name) >= 5;
```

### SQL COMMANDS – Q19
**Question:** Customers whose first name starts with 'a' and ends with 'o'.

**Answer:**

```sql
SELECT * FROM customer WHERE first_name LIKE 'A%o';
```

### SQL COMMANDS – Q20
**Question:** Films with PG and PG-13 rating using IN.

**Answer:**

```sql
SELECT * FROM film WHERE rating IN ('PG', 'PG-13');
```

### SQL COMMANDS – Q21
**Question:** Films with length between 50 and 100 (inclusive).

**Answer:**

```sql
SELECT * FROM film WHERE length BETWEEN 50 AND 100;
```

### SQL COMMANDS – Q22
**Question:** Top 50 actors using LIMIT.

**Answer:**

```sql
SELECT * FROM actor ORDER BY actor_id LIMIT 50;
```

### SQL COMMANDS – Q23
**Question:** Distinct film_ids from inventory table.

**Answer:**

```sql
SELECT DISTINCT film_id FROM inventory;
```

### FUNCTIONS – Q1 (Aggregate)
**Question:** Total number of rentals in Sakila.

**Answer:**

```sql
SELECT COUNT(*) AS total_rentals FROM rental;
```

### FUNCTIONS – Q2 (Aggregate)
**Question:** Average rental duration (days).

**Answer:**

```sql
SELECT AVG(DATEDIFF(return_date, rental_date)) AS avg_rental_days FROM rental WHERE return_date IS NOT NULL;
```

### FUNCTIONS – Q3 (String)
**Question:** Customers' first and last names in uppercase.

**Answer:**

```sql
SELECT UPPER(first_name) AS first_name, UPPER(last_name) AS last_name FROM customer;
```

### FUNCTIONS – Q4 (Date)
**Question:** Extract month from rental_date with rental_id.

**Answer:**

```sql
SELECT rental_id, MONTH(rental_date) AS rental_month FROM rental;
```

### FUNCTIONS – Q5 (GROUP BY)
**Question:** Count of rentals for each customer.

**Answer:**

```sql
SELECT customer_id, COUNT(*) AS rental_count FROM rental GROUP BY customer_id;
```

### FUNCTIONS – Q6 (GROUP BY)
**Question:** Total revenue generated by each store.

**Answer:**

```sql
SELECT s.store_id, SUM(p.amount) AS total_revenue
FROM payment AS p
JOIN staff AS s ON p.staff_id = s.staff_id
GROUP BY s.store_id;
```

### FUNCTIONS – Q7 (GROUP BY)
**Question:** Total rentals for each category.

**Answer:**

```sql
SELECT c.name AS category, COUNT(r.rental_id) AS rental_count
FROM category AS c
JOIN film_category AS fc ON c.category_id = fc.category_id
JOIN inventory AS i ON fc.film_id = i.film_id
JOIN rental AS r ON i.inventory_id = r.inventory_id
GROUP BY c.name;
```

### FUNCTIONS – Q8 (GROUP BY)
**Question:** Average rental rate of movies in each language.

**Answer:**

```sql
SELECT l.name AS language, AVG(f.rental_rate) AS avg_rental_rate
FROM film AS f
JOIN language AS l ON f.language_id = l.language_id
GROUP BY l.name;
```

### JOINS – Q9
**Question:** Title of the movie and customer's first & last name who rented it.

**Answer:**

```sql
SELECT f.title, c.first_name, c.last_name
FROM rental AS r
JOIN inventory AS i ON r.inventory_id = i.inventory_id
JOIN film AS f ON i.film_id = f.film_id
JOIN customer AS c ON r.customer_id = c.customer_id;
```

### JOINS – Q10
**Question:** Names of actors who appeared in film 'Gone with the Wind'.

**Answer:**

```sql
SELECT a.first_name, a.last_name
FROM film AS f
JOIN film_actor AS fa ON f.film_id = fa.film_id
JOIN actor AS a ON fa.actor_id = a.actor_id
WHERE f.title = 'Gone with the Wind';
```

### JOINS – Q11
**Question:** Customer names with the total amount they've spent on rentals.

**Answer:**

```sql
SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent
FROM customer AS c
JOIN payment AS p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name;
```

### JOINS – Q12
**Question:** Titles of movies rented by each customer in a specific city (e.g., London).

**Answer:**

```sql
SELECT c.first_name, c.last_name, f.title
FROM customer AS c
JOIN address AS a   ON c.address_id = a.address_id
JOIN city    AS ci  ON a.city_id = ci.city_id
JOIN rental  AS r   ON c.customer_id = r.customer_id
JOIN inventory AS i ON r.inventory_id = i.inventory_id
JOIN film     AS f  ON i.film_id = f.film_id
WHERE ci.city = 'London'
ORDER BY c.customer_id, f.title;
```

### ADVANCED JOINS – Q13
**Question:** Top 5 rented movies and their rental counts.

**Answer:**

```sql
SELECT f.title, COUNT(r.rental_id) AS rental_count
FROM film AS f
JOIN inventory AS i ON f.film_id = i.film_id
JOIN rental   AS r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id, f.title
ORDER BY rental_count DESC
LIMIT 5;
```

### ADVANCED JOINS – Q14
**Question:** Customers who have rented from both stores (store_id 1 and 2).

**Answer:**

```sql
SELECT c.customer_id, c.first_name, c.last_name
FROM customer AS c
JOIN rental   AS r ON c.customer_id = r.customer_id
JOIN inventory AS i ON r.inventory_id = i.inventory_id
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING SUM(CASE WHEN i.store_id = 1 THEN 1 ELSE 0 END) > 0
   AND SUM(CASE WHEN i.store_id = 2 THEN 1 ELSE 0 END) > 0;
```

### WINDOWS – Q1
**Question:** Rank customers by total amount spent.

**Answer:**

```sql
SELECT
  c.customer_id,
  c.first_name,
  c.last_name,
  SUM(p.amount) AS total_spent,
  RANK() OVER (ORDER BY SUM(p.amount) DESC) AS spend_rank
FROM customer AS c
JOIN payment  AS p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name;
```

### WINDOWS – Q2
**Question:** Cumulative revenue generated by each film over time.

**Answer:**

```sql
SELECT
  f.title,
  p.payment_date,
  p.amount,
  SUM(p.amount) OVER (PARTITION BY f.film_id ORDER BY p.payment_date
                      ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cumulative_revenue
FROM payment AS p
JOIN rental  AS r ON p.rental_id = r.rental_id
JOIN inventory AS i ON r.inventory_id = i.inventory_id
JOIN film AS f ON i.film_id = f.film_id;
```

### WINDOWS – Q3
**Question:** Average rental duration per film, considering films with similar lengths.

**Answer:**

```sql
SELECT
  f.film_id,
  f.title,
  f.length AS film_length,
  AVG(DATEDIFF(r.return_date, r.rental_date)) AS avg_duration,
  AVG(DATEDIFF(r.return_date, r.rental_date)) OVER (PARTITION BY f.length) AS avg_duration_by_length_group
FROM film AS f
JOIN inventory AS i ON f.film_id = i.film_id
JOIN rental   AS r ON i.inventory_id = r.inventory_id
WHERE r.return_date IS NOT NULL
GROUP BY f.film_id, f.title, f.length;
```

### WINDOWS – Q4
**Question:** Top 3 films in each category by rental counts.

**Answer:**

```sql
WITH film_counts AS (
  SELECT
    c.category_id,
    c.name AS category,
    f.film_id,
    f.title,
    COUNT(r.rental_id) AS rental_count
  FROM category AS c
  JOIN film_category AS fc ON c.category_id = fc.category_id
  JOIN film AS f ON fc.film_id = f.film_id
  JOIN inventory AS i ON f.film_id = i.film_id
  JOIN rental AS r ON i.inventory_id = r.inventory_id
  GROUP BY c.category_id, c.name, f.film_id, f.title
)
SELECT *
FROM (
  SELECT
    category,
    title,
    rental_count,
    DENSE_RANK() OVER (PARTITION BY category ORDER BY rental_count DESC) AS rnk
  FROM film_counts
) x
WHERE rnk <= 3
ORDER BY category, rental_count DESC;
```

### WINDOWS – Q5
**Question:** Difference between each customer's rentals and the average rentals.

**Answer:**

```sql
WITH counts AS (
  SELECT customer_id, COUNT(*) AS rentals
  FROM rental
  GROUP BY customer_id
)
SELECT
  c.customer_id,
  c.rentals,
  c.rentals - AVG(c.rentals) OVER () AS diff_from_avg
FROM counts AS c
ORDER BY diff_from_avg DESC;
```

### WINDOWS – Q6
**Question:** Monthly revenue trend for the entire store over time.

**Answer:**

```sql
SELECT
  DATE_FORMAT(p.payment_date, '%Y-%m-01') AS month_start,
  SUM(p.amount) AS monthly_revenue
FROM payment AS p
GROUP BY month_start
ORDER BY month_start;
```

### WINDOWS – Q7
**Question:** Customers whose total spending falls within the top 20% of all customers.

**Answer:**

```sql
WITH totals AS (
  SELECT c.customer_id, c.first_name, c.last_name, SUM(p.amount) AS total_spent
  FROM customer AS c
  JOIN payment  AS p ON c.customer_id = p.customer_id
  GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT *
FROM (
  SELECT
    t.*,
    NTILE(5) OVER (ORDER BY total_spent DESC) AS spend_tile
  FROM totals AS t
) x
WHERE spend_tile = 1
ORDER BY total_spent DESC;
```

### WINDOWS – Q8
**Question:** Running total of rentals per category, ordered by film rental counts.

**Answer:**

```sql
WITH counts AS (
  SELECT
    c.name AS category,
    f.title,
    COUNT(r.rental_id) AS rental_count
  FROM category AS c
  JOIN film_category AS fc ON c.category_id = fc.category_id
  JOIN film AS f ON fc.film_id = f.film_id
  JOIN inventory AS i ON f.film_id = i.film_id
  JOIN rental AS r ON i.inventory_id = r.inventory_id
  GROUP BY c.name, f.title
)
SELECT
  category,
  title,
  rental_count,
  SUM(rental_count) OVER (PARTITION BY category ORDER BY rental_count DESC
                          ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total_in_category
FROM counts
ORDER BY category, running_total_in_category DESC;
```

### WINDOWS – Q9
**Question:** Films rented less than the average rental count for their categories.

**Answer:**

```sql
WITH counts AS (
  SELECT
    c.name AS category,
    f.title,
    COUNT(r.rental_id) AS rental_count
  FROM category AS c
  JOIN film_category AS fc ON c.category_id = fc.category_id
  JOIN film AS f ON fc.film_id = f.film_id
  JOIN inventory AS i ON f.film_id = i.film_id
  JOIN rental AS r ON i.inventory_id = r.inventory_id
  GROUP BY c.name, f.title
)
SELECT *
FROM (
  SELECT
    category,
    title,
    rental_count,
    AVG(rental_count) OVER (PARTITION BY category) AS avg_in_category
  FROM counts
) x
WHERE rental_count < avg_in_category
ORDER BY category, rental_count;
```

### WINDOWS – Q10
**Question:** Top 5 months with the highest revenue.

**Answer:**

```sql
WITH monthly AS (
  SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m-01') AS month_start,
    SUM(p.amount) AS monthly_revenue
  FROM payment AS p
  GROUP BY month_start
)
SELECT *
FROM monthly
ORDER BY monthly_revenue DESC
LIMIT 5;
```

### NORMALISATION – Q1 (1NF)
**Question:** Identify a table in Sakila that violates 1NF and normalize it to 1NF.

**Answer:**

**Answer:** Sakila is already designed close to 3NF and does not visibly violate 1NF.

**If** we had a table `customer_contact(customer_id, phones)` storing multiple phone numbers in one field, it would violate 1NF (repeating groups).

**Normalize to 1NF:**
- Create `customer_phone(customer_id, phone)` so each row stores a single atomic phone.
- Enforce FK: `customer_phone.customer_id → customer.customer_id`.

### NORMALISATION – Q2 (2NF)
**Question:** Choose a table and determine whether it is in 2NF; if not, normalize.

**Answer:**

**Answer:** In tables with **composite PKs** (e.g., `film_actor(film_id, actor_id)`), all non-key columns must depend on the full key. `film_actor` has no non-key columns → already in 2NF.

**If** there were a non-key attribute depending only on part of the key, move it to a separate table keyed by that part to achieve 2NF.

### NORMALISATION – Q3 (3NF)
**Question:** Identify a table that violates 3NF; describe transitive dependencies and normalize.

**Answer:**

**Answer:** Sakila generally satisfies 3NF. A **hypothetical** violation: a denormalized `address_city(address_id, city, country)` where `country` depends on `city` (transitively). Normalize by separating `city(city_id, city, country_id)` and reference `city_id` from `address`.

### NORMALISATION – Q4 (Process)
**Question:** Normalize a specific table from unnormalized form to at least 2NF.

**Answer:**

**Answer (example):**
Unnormalized `order_lines(order_id, customer_name, items_list)` where `items_list` contains multiple items:
1. **1NF:** Split to rows: `order_line(order_id, product_id, qty)`.
2. **2NF:** If PK is `(order_id, product_id)`, move attributes depending only on `order_id` (e.g., `order_date`) to parent `orders(order_id, order_date, customer_id)`.

### CTE – Q5 (Basics)
**Question:** Distinct actor names and number of films they acted in.

**Answer:**

```sql
WITH actor_films AS (
  SELECT a.actor_id, a.first_name, a.last_name, COUNT(fa.film_id) AS film_count
  FROM actor AS a
  LEFT JOIN film_actor AS fa ON a.actor_id = fa.actor_id
  GROUP BY a.actor_id, a.first_name, a.last_name
)
SELECT first_name, last_name, film_count
FROM actor_films
ORDER BY film_count DESC, last_name, first_name;
```

### CTE – Q6 (Join)
**Question:** Combine film and language to show film title, language name, rental rate.

**Answer:**

```sql
WITH film_lang AS (
  SELECT f.film_id, f.title, l.name AS language, f.rental_rate
  FROM film AS f
  JOIN language AS l ON f.language_id = l.language_id
)
SELECT * FROM film_lang ORDER BY title;
```

### CTE – Q7 (Aggregation)
**Question:** Total revenue by each customer (sum of payments).

**Answer:**

```sql
WITH cust_rev AS (
  SELECT customer_id, SUM(amount) AS total_spent
  FROM payment
  GROUP BY customer_id
)
SELECT c.customer_id, c.first_name, c.last_name, cr.total_spent
FROM customer AS c
JOIN cust_rev AS cr ON c.customer_id = cr.customer_id
ORDER BY cr.total_spent DESC;
```

### CTE – Q8 (Window)
**Question:** Rank films based on their rental duration from the film table.

**Answer:**

```sql
WITH durations AS (
  SELECT film_id, title, rental_duration
  FROM film
)
SELECT
  title,
  rental_duration,
  RANK() OVER (ORDER BY rental_duration DESC) AS duration_rank
FROM durations
ORDER BY duration_rank;
```

### CTE – Q9 (Filtering)
**Question:** Customers who made more than two rentals; join to get details.

**Answer:**

```sql
WITH rental_counts AS (
  SELECT customer_id, COUNT(*) AS rentals
  FROM rental
  GROUP BY customer_id
  HAVING COUNT(*) > 2
)
SELECT c.customer_id, c.first_name, c.last_name, rc.rentals
FROM customer AS c
JOIN rental_counts AS rc ON c.customer_id = rc.customer_id
ORDER BY rc.rentals DESC;
```

### CTE – Q10 (Date Calculations)
**Question:** Total number of rentals each month (by rental_date).

**Answer:**

```sql
WITH monthly AS (
  SELECT DATE_FORMAT(rental_date, '%Y-%m-01') AS month_start, COUNT(*) AS rentals
  FROM rental
  GROUP BY month_start
)
SELECT * FROM monthly ORDER BY month_start;
```

### CTE – Q11 (Self-Join)
**Question:** Pairs of actors who have appeared in the same film together.

**Answer:**

```sql
WITH pairs AS (
  SELECT fa1.actor_id AS actor_a, fa2.actor_id AS actor_b, fa1.film_id
  FROM film_actor AS fa1
  JOIN film_actor AS fa2
    ON fa1.film_id = fa2.film_id
   AND fa1.actor_id < fa2.actor_id
)
SELECT a.first_name AS actor_a_first, a.last_name AS actor_a_last,
       b.first_name AS actor_b_first, b.last_name AS actor_b_last,
       f.title
FROM pairs AS p
JOIN actor AS a ON p.actor_a = a.actor_id
JOIN actor AS b ON p.actor_b = b.actor_id
JOIN film  AS f ON p.film_id = f.film_id
ORDER BY f.title, actor_a_last, actor_b_last;
```

### CTE – Q12 (Recursive)
**Question:** Recursive CTE: all employees in `staff` who report to a specific manager (uses `reports_to`).

**Answer:**

```sql
WITH RECURSIVE hierarchy AS (
  -- Start with a chosen manager (e.g., id = :manager_id)
  SELECT s.staff_id, s.first_name, s.last_name, s.reports_to, 0 AS level
  FROM staff AS s
  WHERE s.staff_id = :manager_id

  UNION ALL

  SELECT c.staff_id, c.first_name, c.last_name, c.reports_to, h.level + 1
  FROM staff AS c
  JOIN hierarchy AS h ON c.reports_to = h.staff_id
)
SELECT * FROM hierarchy ORDER BY level, last_name, first_name;
```

----
**Dataset:** Mavenmovies.sql (as provided)

If needed: import the SQL dump into MySQL and connect to run queries.